Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f18175.h
// Register: CWG1CLK
#define CWG1CLK CWG1CLK
extern volatile unsigned char           CWG1CLK             __at(0x60C);
#ifndef _LIB_BUILD
asm("CWG1CLK equ 060Ch");
#endif
// aliases
extern volatile unsigned char           CWG1CLKCON          __at(0x60C);
#ifndef _LIB_BUILD
asm("CWG1CLKCON equ 060Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CS                     :1;
    };
    struct {
        unsigned CWG1CS                 :1;
    };
} CWG1CLKbits_t;
extern volatile CWG1CLKbits_t CWG1CLKbits __at(0x60C);
// bitfield macros
#define _CWG1CLK_CS_POSN                                    0x0
#define _CWG1CLK_CS_POSITION                                0x0
#define _CWG1CLK_CS_SIZE                                    0x1
#define _CWG1CLK_CS_LENGTH                                  0x1
#define _CWG1CLK_CS_MASK                                    0x1
#define _CWG1CLK_CWG1CS_POSN                                0x0
#define _CWG1CLK_CWG1CS_POSITION                            0x0
#define _CWG1CLK_CWG1CS_SIZE                                0x1
#define _CWG1CLK_CWG1CS_LENGTH                              0x1
#define _CWG1CLK_CWG1CS_MASK                                0x1
// alias bitfield definitions
typedef union {
    struct {
        unsigned CS                     :1;
    };
    struct {
        unsigned CWG1CS                 :1;
    };
} CWG1CLKCONbits_t;
extern volatile CWG1CLKCONbits_t CWG1CLKCONbits __at(0x60C);
// bitfield macros
#define _CWG1CLKCON_CS_POSN                                 0x0
#define _CWG1CLKCON_CS_POSITION                             0x0
#define _CWG1CLKCON_CS_SIZE                                 0x1
#define _CWG1CLKCON_CS_LENGTH                               0x1
#define _CWG1CLKCON_CS_MASK                                 0x1
#define _CWG1CLKCON_CWG1CS_POSN                             0x0
#define _CWG1CLKCON_CWG1CS_POSITION                         0x0
#define _CWG1CLKCON_CWG1CS_SIZE                             0x1
#define _CWG1CLKCON_CWG1CS_LENGTH                           0x1
#define _CWG1CLKCON_CWG1CS_MASK                             0x1

// Register: CWG1ISM
#define CWG1ISM CWG1ISM
extern volatile unsigned char           CWG1ISM             __at(0x60D);
#ifndef _LIB_BUILD
asm("CWG1ISM equ 060Dh");
#endif
// aliases
extern volatile unsigned char           CWG1DAT             __at(0x60D);
#ifndef _LIB_BUILD
asm("CWG1DAT equ 060Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ISM                    :8;
    };
    struct {
        unsigned CWG1ISM                :8;
    };
    struct {
        unsigned ISM0                   :1;
        unsigned ISM1                   :1;
        unsigned ISM2                   :1;
        unsigned ISM3                   :1;
        unsigned ISM4                   :1;
    };
    struct {
        unsigned DAT                    :8;
    };
    struct {
        unsigned DAT0                   :1;
        unsigned DAT1                   :1;
        unsigned DAT2                   :1;
        unsigned DAT3                   :1;
        unsigned DAT4                   :1;
    };
} CWG1ISMbits_t;
extern volatile CWG1ISMbits_t CWG1ISMbits __at(0x60D);
// bitfield macros
#define _CWG1ISM_ISM_POSN                                   0x0
#define _CWG1ISM_ISM_POSITION                               0x0
#define _CWG1ISM_ISM_SIZE                                   0x8
#define _CWG1ISM_ISM_LENGTH                                 0x8
#define _CWG1ISM_ISM_MASK                                   0xFF
#define _CWG1ISM_CWG1ISM_POSN                               0x0
#define _CWG1ISM_CWG1ISM_POSITION                           0x0
#define _CWG1ISM_CWG1ISM_SIZE                               0x8
#define _CWG1ISM_CWG1ISM_LENGTH                             0x8
#define _CWG1ISM_CWG1ISM_MASK                               0xFF
#define _CWG1ISM_ISM0_POSN                                  0x0
#define _CWG1ISM_ISM0_POSITION                              0x0
#define _CWG1ISM_ISM0_SIZE                                  0x1
#define _CWG1ISM_ISM0_LENGTH                                0x1
#define _CWG1ISM_ISM0_MASK                                  0x1
#define _CWG1ISM_ISM1_POSN                                  0x1
#define _CWG1ISM_ISM1_POSITION                              0x1
#define _CWG1ISM_ISM1_SIZE                                  0x1
#define _CWG1ISM_ISM1_LENGTH                                0x1
#define _CWG1ISM_ISM1_MASK                                  0x2
#define _CWG1ISM_ISM2_POSN                                  0x2
#define _CWG1ISM_ISM2_POSITION                              0x2
#define _CWG1ISM_ISM2_SIZE                                  0x1
#define _CWG1ISM_ISM2_LENGTH                                0x1
#define _CWG1ISM_ISM2_MASK                                  0x4
#define _CWG1ISM_ISM3_POSN                                  0x3
#define _CWG1ISM_ISM3_POSITION                              0x3
#define _CWG1ISM_ISM3_SIZE                                  0x1
#define _CWG1ISM_ISM3_LENGTH                                0x1
#define _CWG1ISM_ISM3_MASK                                  0x8
#define _CWG1ISM_ISM4_POSN                                  0x4
#define _CWG1ISM_ISM4_POSITION                              0x4
#define _CWG1ISM_ISM4_SIZE                                  0x1
#define _CWG1ISM_ISM4_LENGTH                                0x1
#define _CWG1ISM_ISM4_MASK                                  0x10
#define _CWG1ISM_DAT_POSN                                   0x0
#define _CWG1ISM_DAT_POSITION                               0x0
#define _CWG1ISM_DAT_SIZE                                   0x8
#define _CWG1ISM_DAT_LENGTH                                 0x8
#define _CWG1ISM_DAT_MASK                                   0xFF
#define _CWG1ISM_DAT0_POSN                                  0x0
#define _CWG1ISM_DAT0_POSITION                              0x0
#define _CWG1ISM_DAT0_SIZE                                  0x1
#define _CWG1ISM_DAT0_LENGTH                                0x1
#define _CWG1ISM_DAT0_MASK                                  0x1
#define _CWG1ISM_DAT1_POSN                                  0x1
#define _CWG1ISM_DAT1_POSITION                              0x1
#define _CWG1ISM_DAT1_SIZE                                  0x1
#define _CWG1ISM_DAT1_LENGTH                                0x1
#define _CWG1ISM_DAT1_MASK                                  0x2
#define _CWG1ISM_DAT2_POSN                                  0x2
#define _CWG1ISM_DAT2_POSITION                              0x2
#define _CWG1ISM_DAT2_SIZE                                  0x1
#define _CWG1ISM_DAT2_LENGTH                                0x1
#define _CWG1ISM_DAT2_MASK                                  0x4
#define _CWG1ISM_DAT3_POSN                                  0x3
#define _CWG1ISM_DAT3_POSITION                              0x3
#define _CWG1ISM_DAT3_SIZE                                  0x1
#define _CWG1ISM_DAT3_LENGTH                                0x1
#define _CWG1ISM_DAT3_MASK                                  0x8
#define _CWG1ISM_DAT4_POSN                                  0x4
#define _CWG1ISM_DAT4_POSITION                              0x4
#define _CWG1ISM_DAT4_SIZE                                  0x1
#define _CWG1ISM_DAT4_LENGTH                                0x1
#define _CWG1ISM_DAT4_MASK                                  0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned ISM                    :8;
    };
    struct {
        unsigned CWG1ISM                :8;
    };
    struct {
        unsigned ISM0                   :1;
        unsigned ISM1                   :1;
        unsigned ISM2                   :1;
        unsigned ISM3                   :1;
        unsigned ISM4                   :1;
    };
    struct {
        unsigned DAT                    :8;
    };
    struct {
        unsigned DAT0                   :1;
        unsigned DAT1                   :1;
        unsigned DAT2                   :1;
        unsigned DAT3                   :1;
        unsigned DAT4                   :1;
    };
} CWG1DATbits_t;
