Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f18175.h
extern volatile RA2PPSbits_t RA2PPSbits __at(0x1D8E);
// bitfield macros
#define _RA2PPS_RA2PPS_POSN                                 0x0
#define _RA2PPS_RA2PPS_POSITION                             0x0
#define _RA2PPS_RA2PPS_SIZE                                 0x6
#define _RA2PPS_RA2PPS_LENGTH                               0x6
#define _RA2PPS_RA2PPS_MASK                                 0x3F

// Register: RA3PPS
#define RA3PPS RA3PPS
extern volatile unsigned char           RA3PPS              __at(0x1D8F);
#ifndef _LIB_BUILD
asm("RA3PPS equ 01D8Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA3PPS                 :6;
    };
} RA3PPSbits_t;
extern volatile RA3PPSbits_t RA3PPSbits __at(0x1D8F);
// bitfield macros
#define _RA3PPS_RA3PPS_POSN                                 0x0
#define _RA3PPS_RA3PPS_POSITION                             0x0
#define _RA3PPS_RA3PPS_SIZE                                 0x6
#define _RA3PPS_RA3PPS_LENGTH                               0x6
#define _RA3PPS_RA3PPS_MASK                                 0x3F

// Register: RA4PPS
#define RA4PPS RA4PPS
extern volatile unsigned char           RA4PPS              __at(0x1D90);
#ifndef _LIB_BUILD
asm("RA4PPS equ 01D90h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA4PPS                 :6;
    };
} RA4PPSbits_t;
extern volatile RA4PPSbits_t RA4PPSbits __at(0x1D90);
// bitfield macros
#define _RA4PPS_RA4PPS_POSN                                 0x0
#define _RA4PPS_RA4PPS_POSITION                             0x0
#define _RA4PPS_RA4PPS_SIZE                                 0x6
#define _RA4PPS_RA4PPS_LENGTH                               0x6
#define _RA4PPS_RA4PPS_MASK                                 0x3F

// Register: RA5PPS
#define RA5PPS RA5PPS
extern volatile unsigned char           RA5PPS              __at(0x1D91);
#ifndef _LIB_BUILD
asm("RA5PPS equ 01D91h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA5PPS                 :6;
    };
} RA5PPSbits_t;
extern volatile RA5PPSbits_t RA5PPSbits __at(0x1D91);
// bitfield macros
#define _RA5PPS_RA5PPS_POSN                                 0x0
#define _RA5PPS_RA5PPS_POSITION                             0x0
#define _RA5PPS_RA5PPS_SIZE                                 0x6
#define _RA5PPS_RA5PPS_LENGTH                               0x6
#define _RA5PPS_RA5PPS_MASK                                 0x3F

// Register: RA6PPS
#define RA6PPS RA6PPS
extern volatile unsigned char           RA6PPS              __at(0x1D92);
#ifndef _LIB_BUILD
asm("RA6PPS equ 01D92h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA6PPS                 :6;
    };
} RA6PPSbits_t;
extern volatile RA6PPSbits_t RA6PPSbits __at(0x1D92);
// bitfield macros
#define _RA6PPS_RA6PPS_POSN                                 0x0
#define _RA6PPS_RA6PPS_POSITION                             0x0
#define _RA6PPS_RA6PPS_SIZE                                 0x6
#define _RA6PPS_RA6PPS_LENGTH                               0x6
#define _RA6PPS_RA6PPS_MASK                                 0x3F

// Register: RA7PPS
#define RA7PPS RA7PPS
extern volatile unsigned char           RA7PPS              __at(0x1D93);
#ifndef _LIB_BUILD
asm("RA7PPS equ 01D93h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA7PPS                 :6;
    };
} RA7PPSbits_t;
extern volatile RA7PPSbits_t RA7PPSbits __at(0x1D93);
// bitfield macros
#define _RA7PPS_RA7PPS_POSN                                 0x0
#define _RA7PPS_RA7PPS_POSITION                             0x0
#define _RA7PPS_RA7PPS_SIZE                                 0x6
#define _RA7PPS_RA7PPS_LENGTH                               0x6
#define _RA7PPS_RA7PPS_MASK                                 0x3F

// Register: RB0PPS
#define RB0PPS RB0PPS
extern volatile unsigned char           RB0PPS              __at(0x1D94);
#ifndef _LIB_BUILD
asm("RB0PPS equ 01D94h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RB0PPS                 :6;
    };
} RB0PPSbits_t;
extern volatile RB0PPSbits_t RB0PPSbits __at(0x1D94);
// bitfield macros
#define _RB0PPS_RB0PPS_POSN                                 0x0
#define _RB0PPS_RB0PPS_POSITION                             0x0
#define _RB0PPS_RB0PPS_SIZE                                 0x6
#define _RB0PPS_RB0PPS_LENGTH                               0x6
#define _RB0PPS_RB0PPS_MASK                                 0x3F

// Register: RB1PPS
#define RB1PPS RB1PPS
extern volatile unsigned char           RB1PPS              __at(0x1D95);
#ifndef _LIB_BUILD
asm("RB1PPS equ 01D95h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RB1PPS                 :6;
    };
} RB1PPSbits_t;
extern volatile RB1PPSbits_t RB1PPSbits __at(0x1D95);
// bitfield macros
#define _RB1PPS_RB1PPS_POSN                                 0x0
#define _RB1PPS_RB1PPS_POSITION                             0x0
#define _RB1PPS_RB1PPS_SIZE                                 0x6
#define _RB1PPS_RB1PPS_LENGTH                               0x6
#define _RB1PPS_RB1PPS_MASK                                 0x3F

// Register: RB2PPS
#define RB2PPS RB2PPS
extern volatile unsigned char           RB2PPS              __at(0x1D96);
#ifndef _LIB_BUILD
asm("RB2PPS equ 01D96h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RB2PPS                 :6;
    };
} RB2PPSbits_t;
extern volatile RB2PPSbits_t RB2PPSbits __at(0x1D96);
// bitfield macros
#define _RB2PPS_RB2PPS_POSN                                 0x0
#define _RB2PPS_RB2PPS_POSITION                             0x0
#define _RB2PPS_RB2PPS_SIZE                                 0x6
#define _RB2PPS_RB2PPS_LENGTH                               0x6
#define _RB2PPS_RB2PPS_MASK                                 0x3F

// Register: RB3PPS
#define RB3PPS RB3PPS
extern volatile unsigned char           RB3PPS              __at(0x1D97);
#ifndef _LIB_BUILD
asm("RB3PPS equ 01D97h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RB3PPS                 :6;
    };
} RB3PPSbits_t;
