Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f18175.h
extern volatile __bit                   CCP2PPS4            __at(0xF0FC);	// @ (0x1E1F * 8 + 4)
#define                                 CCP2PPS4_bit        _BIT_ACCESS(CCP2PPS,4)
// CCP2PPS<CCP2PPS5>
extern volatile __bit                   CCP2PPS5            __at(0xF0FD);	// @ (0x1E1F * 8 + 5)
#define                                 CCP2PPS5_bit        _BIT_ACCESS(CCP2PPS,5)
// FVRCON<CDAFVR0>
extern volatile __bit                   CDAFVR0             __at(0x1062);	// @ (0x20C * 8 + 2)
#define                                 CDAFVR0_bit         _BIT_ACCESS(FVRCON,2)
// FVRCON<CDAFVR1>
extern volatile __bit                   CDAFVR1             __at(0x1063);	// @ (0x20C * 8 + 3)
#define                                 CDAFVR1_bit         _BIT_ACCESS(FVRCON,3)
// OSCCON2<CDIV0>
extern volatile __bit                   CDIV0               __at(0x1470);	// @ (0x28E * 8 + 0)
#define                                 CDIV0_bit           _BIT_ACCESS(OSCCON2,0)
// OSCCON2<CDIV1>
extern volatile __bit                   CDIV1               __at(0x1471);	// @ (0x28E * 8 + 1)
#define                                 CDIV1_bit           _BIT_ACCESS(OSCCON2,1)
// OSCCON2<CDIV2>
extern volatile __bit                   CDIV2               __at(0x1472);	// @ (0x28E * 8 + 2)
#define                                 CDIV2_bit           _BIT_ACCESS(OSCCON2,2)
// OSCCON2<CDIV3>
extern volatile __bit                   CDIV3               __at(0x1473);	// @ (0x28E * 8 + 3)
#define                                 CDIV3_bit           _BIT_ACCESS(OSCCON2,3)
// ADCG1A<CGA0>
extern volatile __bit                   CGA0                __at(0xE970);	// @ (0x1D2E * 8 + 0)
#define                                 CGA0_bit            _BIT_ACCESS(ADCG1A,0)
// ADCG1A<CGA1>
extern volatile __bit                   CGA1                __at(0xE971);	// @ (0x1D2E * 8 + 1)
#define                                 CGA1_bit            _BIT_ACCESS(ADCG1A,1)
// ADCG1A<CGA2>
extern volatile __bit                   CGA2                __at(0xE972);	// @ (0x1D2E * 8 + 2)
#define                                 CGA2_bit            _BIT_ACCESS(ADCG1A,2)
// ADCG1A<CGA3>
extern volatile __bit                   CGA3                __at(0xE973);	// @ (0x1D2E * 8 + 3)
#define                                 CGA3_bit            _BIT_ACCESS(ADCG1A,3)
// ADCG1A<CGA4>
extern volatile __bit                   CGA4                __at(0xE974);	// @ (0x1D2E * 8 + 4)
#define                                 CGA4_bit            _BIT_ACCESS(ADCG1A,4)
// ADCG1A<CGA5>
extern volatile __bit                   CGA5                __at(0xE975);	// @ (0x1D2E * 8 + 5)
#define                                 CGA5_bit            _BIT_ACCESS(ADCG1A,5)
// ADCG1A<CGA6>
extern volatile __bit                   CGA6                __at(0xE976);	// @ (0x1D2E * 8 + 6)
#define                                 CGA6_bit            _BIT_ACCESS(ADCG1A,6)
// ADCG1A<CGA7>
extern volatile __bit                   CGA7                __at(0xE977);	// @ (0x1D2E * 8 + 7)
#define                                 CGA7_bit            _BIT_ACCESS(ADCG1A,7)
// ADCG1B<CGB0>
extern volatile __bit                   CGB0                __at(0xE978);	// @ (0x1D2F * 8 + 0)
#define                                 CGB0_bit            _BIT_ACCESS(ADCG1B,0)
// ADCG1B<CGB1>
extern volatile __bit                   CGB1                __at(0xE979);	// @ (0x1D2F * 8 + 1)
#define                                 CGB1_bit            _BIT_ACCESS(ADCG1B,1)
// ADCG1B<CGB2>
extern volatile __bit                   CGB2                __at(0xE97A);	// @ (0x1D2F * 8 + 2)
#define                                 CGB2_bit            _BIT_ACCESS(ADCG1B,2)
// ADCG1B<CGB3>
extern volatile __bit                   CGB3                __at(0xE97B);	// @ (0x1D2F * 8 + 3)
#define                                 CGB3_bit            _BIT_ACCESS(ADCG1B,3)
// ADCG1B<CGB4>
extern volatile __bit                   CGB4                __at(0xE97C);	// @ (0x1D2F * 8 + 4)
#define                                 CGB4_bit            _BIT_ACCESS(ADCG1B,4)
// ADCG1B<CGB5>
extern volatile __bit                   CGB5                __at(0xE97D);	// @ (0x1D2F * 8 + 5)
#define                                 CGB5_bit            _BIT_ACCESS(ADCG1B,5)
// ADCG1B<CGB6>
extern volatile __bit                   CGB6                __at(0xE97E);	// @ (0x1D2F * 8 + 6)
#define                                 CGB6_bit            _BIT_ACCESS(ADCG1B,6)
// ADCG1B<CGB7>
extern volatile __bit                   CGB7                __at(0xE97F);	// @ (0x1D2F * 8 + 7)
#define                                 CGB7_bit            _BIT_ACCESS(ADCG1B,7)
// ADCG1C<CGC0>
extern volatile __bit                   CGC0                __at(0xE980);	// @ (0x1D30 * 8 + 0)
#define                                 CGC0_bit            _BIT_ACCESS(ADCG1C,0)
// ADCG1C<CGC1>
extern volatile __bit                   CGC1                __at(0xE981);	// @ (0x1D30 * 8 + 1)
#define                                 CGC1_bit            _BIT_ACCESS(ADCG1C,1)
// ADCG1C<CGC2>
extern volatile __bit                   CGC2                __at(0xE982);	// @ (0x1D30 * 8 + 2)
#define                                 CGC2_bit            _BIT_ACCESS(ADCG1C,2)
// ADCG1C<CGC3>
extern volatile __bit                   CGC3                __at(0xE983);	// @ (0x1D30 * 8 + 3)
#define                                 CGC3_bit            _BIT_ACCESS(ADCG1C,3)
// ADCG1C<CGC4>
extern volatile __bit                   CGC4                __at(0xE984);	// @ (0x1D30 * 8 + 4)
#define                                 CGC4_bit            _BIT_ACCESS(ADCG1C,4)
// ADCG1C<CGC5>
extern volatile __bit                   CGC5                __at(0xE985);	// @ (0x1D30 * 8 + 5)
#define                                 CGC5_bit            _BIT_ACCESS(ADCG1C,5)
// ADCG1C<CGC6>
extern volatile __bit                   CGC6                __at(0xE986);	// @ (0x1D30 * 8 + 6)
#define                                 CGC6_bit            _BIT_ACCESS(ADCG1C,6)
// ADCG1C<CGC7>
extern volatile __bit                   CGC7                __at(0xE987);	// @ (0x1D30 * 8 + 7)
#define                                 CGC7_bit            _BIT_ACCESS(ADCG1C,7)
// ADCG1D<CGD0>
extern volatile __bit                   CGD0                __at(0xE988);	// @ (0x1D31 * 8 + 0)
#define                                 CGD0_bit            _BIT_ACCESS(ADCG1D,0)
// ADCG1D<CGD1>
extern volatile __bit                   CGD1                __at(0xE989);	// @ (0x1D31 * 8 + 1)
#define                                 CGD1_bit            _BIT_ACCESS(ADCG1D,1)
// ADCG1D<CGD2>
extern volatile __bit                   CGD2                __at(0xE98A);	// @ (0x1D31 * 8 + 2)
#define                                 CGD2_bit            _BIT_ACCESS(ADCG1D,2)
// ADCG1D<CGD3>
extern volatile __bit                   CGD3                __at(0xE98B);	// @ (0x1D31 * 8 + 3)
#define                                 CGD3_bit            _BIT_ACCESS(ADCG1D,3)
// ADCG1D<CGD4>
extern volatile __bit                   CGD4                __at(0xE98C);	// @ (0x1D31 * 8 + 4)
#define                                 CGD4_bit            _BIT_ACCESS(ADCG1D,4)
// ADCG1D<CGD5>
extern volatile __bit                   CGD5                __at(0xE98D);	// @ (0x1D31 * 8 + 5)
#define                                 CGD5_bit            _BIT_ACCESS(ADCG1D,5)
// ADCG1D<CGD6>
extern volatile __bit                   CGD6                __at(0xE98E);	// @ (0x1D31 * 8 + 6)
#define                                 CGD6_bit            _BIT_ACCESS(ADCG1D,6)
// ADCG1D<CGD7>
extern volatile __bit                   CGD7                __at(0xE98F);	// @ (0x1D31 * 8 + 7)
#define                                 CGD7_bit            _BIT_ACCESS(ADCG1D,7)
// ADCG1E<CGE0>
extern volatile __bit                   CGE0                __at(0xE990);	// @ (0x1D32 * 8 + 0)
#define                                 CGE0_bit            _BIT_ACCESS(ADCG1E,0)
// ADCG1E<CGE1>
extern volatile __bit                   CGE1                __at(0xE991);	// @ (0x1D32 * 8 + 1)
#define                                 CGE1_bit            _BIT_ACCESS(ADCG1E,1)
// ADCG1E<CGE2>
extern volatile __bit                   CGE2                __at(0xE992);	// @ (0x1D32 * 8 + 2)
#define                                 CGE2_bit            _BIT_ACCESS(ADCG1E,2)
// SSP1STAT<CKE1>
extern volatile __bit                   CKE1                __at(0x3C7E);	// @ (0x78F * 8 + 6)
#define                                 CKE1_bit            _BIT_ACCESS(SSP1STAT,6)
// SSP2STAT<CKE2>
extern volatile __bit                   CKE2                __at(0x3CCE);	// @ (0x799 * 8 + 6)
#define                                 CKE2_bit            _BIT_ACCESS(SSP2STAT,6)
// SSP1CON1<CKP1>
extern volatile __bit                   CKP1                __at(0x3C84);	// @ (0x790 * 8 + 4)
#define                                 CKP1_bit            _BIT_ACCESS(SSP1CON1,4)
// SSP2CON1<CKP2>
extern volatile __bit                   CKP2                __at(0x3CD4);	// @ (0x79A * 8 + 4)
#define                                 CKP2_bit            _BIT_ACCESS(SSP2CON1,4)
// T0CON1<CKPS3>
extern volatile __bit                   CKPS3               __at(0xCFB);	// @ (0x19F * 8 + 3)
#define                                 CKPS3_bit           _BIT_ACCESS(T0CON1,3)
// NCO1CLK<CKS0>
extern volatile __bit                   CKS0                __at(0x2C98);	// @ (0x593 * 8 + 0)
#define                                 CKS0_bit            _BIT_ACCESS(NCO1CLK,0)
// NCO1CLK<CKS1>
extern volatile __bit                   CKS1                __at(0x2C99);	// @ (0x593 * 8 + 1)
#define                                 CKS1_bit            _BIT_ACCESS(NCO1CLK,1)
// NCO1CLK<CKS2>
extern volatile __bit                   CKS2                __at(0x2C9A);	// @ (0x593 * 8 + 2)
#define                                 CKS2_bit            _BIT_ACCESS(NCO1CLK,2)
// NCO1CLK<CKS3>
extern volatile __bit                   CKS3                __at(0x2C9B);	// @ (0x593 * 8 + 3)
#define                                 CKS3_bit            _BIT_ACCESS(NCO1CLK,3)
// PIE4<CLC1IE>
extern volatile __bit                   CLC1IE              __at(0x4D2);	// @ (0x9A * 8 + 2)
#define                                 CLC1IE_bit          _BIT_ACCESS(PIE4,2)
// PIR4<CLC1IF>
extern volatile __bit                   CLC1IF              __at(0x482);	// @ (0x90 * 8 + 2)
#define                                 CLC1IF_bit          _BIT_ACCESS(PIR4,2)
// PMD2<CLC1MD>
extern volatile __bit                   CLC1MD              __at(0x875);	// @ (0x10E * 8 + 5)
#define                                 CLC1MD_bit          _BIT_ACCESS(PMD2,5)
// CLCDATA<CLC1OUT>
extern volatile __bit                   CLC1OUT             __at(0x34B8);	// @ (0x697 * 8 + 0)
#define                                 CLC1OUT_bit         _BIT_ACCESS(CLCDATA,0)
// PIE4<CLC2IE>
extern volatile __bit                   CLC2IE              __at(0x4D3);	// @ (0x9A * 8 + 3)
#define                                 CLC2IE_bit          _BIT_ACCESS(PIE4,3)
// PIR4<CLC2IF>
extern volatile __bit                   CLC2IF              __at(0x483);	// @ (0x90 * 8 + 3)
#define                                 CLC2IF_bit          _BIT_ACCESS(PIR4,3)
// PMD2<CLC2MD>
extern volatile __bit                   CLC2MD              __at(0x876);	// @ (0x10E * 8 + 6)
#define                                 CLC2MD_bit          _BIT_ACCESS(PMD2,6)
// CLCDATA<CLC2OUT>
extern volatile __bit                   CLC2OUT             __at(0x34B9);	// @ (0x697 * 8 + 1)
#define                                 CLC2OUT_bit         _BIT_ACCESS(CLCDATA,1)
// PIE4<CLC3IE>
extern volatile __bit                   CLC3IE              __at(0x4D4);	// @ (0x9A * 8 + 4)
#define                                 CLC3IE_bit          _BIT_ACCESS(PIE4,4)
// PIR4<CLC3IF>
extern volatile __bit                   CLC3IF              __at(0x484);	// @ (0x90 * 8 + 4)
#define                                 CLC3IF_bit          _BIT_ACCESS(PIR4,4)
// PMD2<CLC3MD>
extern volatile __bit                   CLC3MD              __at(0x877);	// @ (0x10E * 8 + 7)
#define                                 CLC3MD_bit          _BIT_ACCESS(PMD2,7)
// CLCDATA<CLC3OUT>
extern volatile __bit                   CLC3OUT             __at(0x34BA);	// @ (0x697 * 8 + 2)
#define                                 CLC3OUT_bit         _BIT_ACCESS(CLCDATA,2)
// PIE4<CLC4IE>
extern volatile __bit                   CLC4IE              __at(0x4D5);	// @ (0x9A * 8 + 5)
#define                                 CLC4IE_bit          _BIT_ACCESS(PIE4,5)
// PIR4<CLC4IF>
extern volatile __bit                   CLC4IF              __at(0x485);	// @ (0x90 * 8 + 5)
#define                                 CLC4IF_bit          _BIT_ACCESS(PIR4,5)
// PMD3<CLC4MD>
extern volatile __bit                   CLC4MD              __at(0x878);	// @ (0x10F * 8 + 0)
#define                                 CLC4MD_bit          _BIT_ACCESS(PMD3,0)
// CLCDATA<CLC4OUT>
extern volatile __bit                   CLC4OUT             __at(0x34BB);	// @ (0x697 * 8 + 3)
#define                                 CLC4OUT_bit         _BIT_ACCESS(CLCDATA,3)
// CLCIN0PPS<CLCIN0PPS0>
extern volatile __bit                   CLCIN0PPS0          __at(0xF1E8);	// @ (0x1E3D * 8 + 0)
#define                                 CLCIN0PPS0_bit      _BIT_ACCESS(CLCIN0PPS,0)
// CLCIN0PPS<CLCIN0PPS1>
extern volatile __bit                   CLCIN0PPS1          __at(0xF1E9);	// @ (0x1E3D * 8 + 1)
#define                                 CLCIN0PPS1_bit      _BIT_ACCESS(CLCIN0PPS,1)
// CLCIN0PPS<CLCIN0PPS2>
extern volatile __bit                   CLCIN0PPS2          __at(0xF1EA);	// @ (0x1E3D * 8 + 2)
#define                                 CLCIN0PPS2_bit      _BIT_ACCESS(CLCIN0PPS,2)
// CLCIN0PPS<CLCIN0PPS3>
extern volatile __bit                   CLCIN0PPS3          __at(0xF1EB);	// @ (0x1E3D * 8 + 3)
#define                                 CLCIN0PPS3_bit      _BIT_ACCESS(CLCIN0PPS,3)
// CLCIN0PPS<CLCIN0PPS4>
extern volatile __bit                   CLCIN0PPS4          __at(0xF1EC);	// @ (0x1E3D * 8 + 4)
#define                                 CLCIN0PPS4_bit      _BIT_ACCESS(CLCIN0PPS,4)
// CLCIN0PPS<CLCIN0PPS5>
extern volatile __bit                   CLCIN0PPS5          __at(0xF1ED);	// @ (0x1E3D * 8 + 5)
#define                                 CLCIN0PPS5_bit      _BIT_ACCESS(CLCIN0PPS,5)
// CLCIN1PPS<CLCIN1PPS0>
extern volatile __bit                   CLCIN1PPS0          __at(0xF1F0);	// @ (0x1E3E * 8 + 0)
#define                                 CLCIN1PPS0_bit      _BIT_ACCESS(CLCIN1PPS,0)
// CLCIN1PPS<CLCIN1PPS1>
extern volatile __bit                   CLCIN1PPS1          __at(0xF1F1);	// @ (0x1E3E * 8 + 1)
#define                                 CLCIN1PPS1_bit      _BIT_ACCESS(CLCIN1PPS,1)
// CLCIN1PPS<CLCIN1PPS2>
extern volatile __bit                   CLCIN1PPS2          __at(0xF1F2);	// @ (0x1E3E * 8 + 2)
#define                                 CLCIN1PPS2_bit      _BIT_ACCESS(CLCIN1PPS,2)
// CLCIN1PPS<CLCIN1PPS3>
extern volatile __bit                   CLCIN1PPS3          __at(0xF1F3);	// @ (0x1E3E * 8 + 3)
#define                                 CLCIN1PPS3_bit      _BIT_ACCESS(CLCIN1PPS,3)
// CLCIN1PPS<CLCIN1PPS4>
extern volatile __bit                   CLCIN1PPS4          __at(0xF1F4);	// @ (0x1E3E * 8 + 4)
#define                                 CLCIN1PPS4_bit      _BIT_ACCESS(CLCIN1PPS,4)
// CLCIN1PPS<CLCIN1PPS5>
extern volatile __bit                   CLCIN1PPS5          __at(0xF1F5);	// @ (0x1E3E * 8 + 5)
#define                                 CLCIN1PPS5_bit      _BIT_ACCESS(CLCIN1PPS,5)
// CLCIN2PPS<CLCIN2PPS0>
extern volatile __bit                   CLCIN2PPS0          __at(0xF1F8);	// @ (0x1E3F * 8 + 0)
#define                                 CLCIN2PPS0_bit      _BIT_ACCESS(CLCIN2PPS,0)
// CLCIN2PPS<CLCIN2PPS1>
extern volatile __bit                   CLCIN2PPS1          __at(0xF1F9);	// @ (0x1E3F * 8 + 1)
#define                                 CLCIN2PPS1_bit      _BIT_ACCESS(CLCIN2PPS,1)
// CLCIN2PPS<CLCIN2PPS2>
extern volatile __bit                   CLCIN2PPS2          __at(0xF1FA);	// @ (0x1E3F * 8 + 2)
#define                                 CLCIN2PPS2_bit      _BIT_ACCESS(CLCIN2PPS,2)
// CLCIN2PPS<CLCIN2PPS3>
extern volatile __bit                   CLCIN2PPS3          __at(0xF1FB);	// @ (0x1E3F * 8 + 3)
#define                                 CLCIN2PPS3_bit      _BIT_ACCESS(CLCIN2PPS,3)
// CLCIN2PPS<CLCIN2PPS4>
extern volatile __bit                   CLCIN2PPS4          __at(0xF1FC);	// @ (0x1E3F * 8 + 4)
#define                                 CLCIN2PPS4_bit      _BIT_ACCESS(CLCIN2PPS,4)
// CLCIN2PPS<CLCIN2PPS5>
extern volatile __bit                   CLCIN2PPS5          __at(0xF1FD);	// @ (0x1E3F * 8 + 5)
#define                                 CLCIN2PPS5_bit      _BIT_ACCESS(CLCIN2PPS,5)
// CLCIN3PPS<CLCIN3PPS0>
extern volatile __bit                   CLCIN3PPS0          __at(0xF200);	// @ (0x1E40 * 8 + 0)
#define                                 CLCIN3PPS0_bit      _BIT_ACCESS(CLCIN3PPS,0)
// CLCIN3PPS<CLCIN3PPS1>
extern volatile __bit                   CLCIN3PPS1          __at(0xF201);	// @ (0x1E40 * 8 + 1)
#define                                 CLCIN3PPS1_bit      _BIT_ACCESS(CLCIN3PPS,1)
// CLCIN3PPS<CLCIN3PPS2>
extern volatile __bit                   CLCIN3PPS2          __at(0xF202);	// @ (0x1E40 * 8 + 2)
#define                                 CLCIN3PPS2_bit      _BIT_ACCESS(CLCIN3PPS,2)
// CLCIN3PPS<CLCIN3PPS3>
extern volatile __bit                   CLCIN3PPS3          __at(0xF203);	// @ (0x1E40 * 8 + 3)
#define                                 CLCIN3PPS3_bit      _BIT_ACCESS(CLCIN3PPS,3)
// CLCIN3PPS<CLCIN3PPS4>
extern volatile __bit                   CLCIN3PPS4          __at(0xF204);	// @ (0x1E40 * 8 + 4)
#define                                 CLCIN3PPS4_bit      _BIT_ACCESS(CLCIN3PPS,4)
// CLCIN3PPS<CLCIN3PPS5>
extern volatile __bit                   CLCIN3PPS5          __at(0xF205);	// @ (0x1E40 * 8 + 5)
#define                                 CLCIN3PPS5_bit      _BIT_ACCESS(CLCIN3PPS,5)
// CLKRCLK<CLKRCLK0>
extern volatile __bit                   CLKRCLK0            __at(0x14B8);	// @ (0x297 * 8 + 0)
#define                                 CLKRCLK0_bit        _BIT_ACCESS(CLKRCLK,0)
// CLKRCLK<CLKRCLK1>
extern volatile __bit                   CLKRCLK1            __at(0x14B9);	// @ (0x297 * 8 + 1)
#define                                 CLKRCLK1_bit        _BIT_ACCESS(CLKRCLK,1)
// CLKRCLK<CLKRCLK2>
extern volatile __bit                   CLKRCLK2            __at(0x14BA);	// @ (0x297 * 8 + 2)
#define                                 CLKRCLK2_bit        _BIT_ACCESS(CLKRCLK,2)
// CLKRCLK<CLKRCLK3>
extern volatile __bit                   CLKRCLK3            __at(0x14BB);	// @ (0x297 * 8 + 3)
#define                                 CLKRCLK3_bit        _BIT_ACCESS(CLKRCLK,3)
// CLKRCON<CLKRDC0>
extern volatile __bit                   CLKRDC0             __at(0x14B3);	// @ (0x296 * 8 + 3)
#define                                 CLKRDC0_bit         _BIT_ACCESS(CLKRCON,3)
// CLKRCON<CLKRDC1>
extern volatile __bit                   CLKRDC1             __at(0x14B4);	// @ (0x296 * 8 + 4)
#define                                 CLKRDC1_bit         _BIT_ACCESS(CLKRCON,4)
// CLKRCON<CLKRDIV0>
extern volatile __bit                   CLKRDIV0            __at(0x14B0);	// @ (0x296 * 8 + 0)
#define                                 CLKRDIV0_bit        _BIT_ACCESS(CLKRCON,0)
// CLKRCON<CLKRDIV1>
extern volatile __bit                   CLKRDIV1            __at(0x14B1);	// @ (0x296 * 8 + 1)
#define                                 CLKRDIV1_bit        _BIT_ACCESS(CLKRCON,1)
// CLKRCON<CLKRDIV2>
extern volatile __bit                   CLKRDIV2            __at(0x14B2);	// @ (0x296 * 8 + 2)
#define                                 CLKRDIV2_bit        _BIT_ACCESS(CLKRCON,2)
// CLKRCON<CLKREN>
extern volatile __bit                   CLKREN              __at(0x14B7);	// @ (0x296 * 8 + 7)
#define                                 CLKREN_bit          _BIT_ACCESS(CLKRCON,7)
// PMD0<CLKRMD>
extern volatile __bit                   CLKRMD              __at(0x866);	// @ (0x10C * 8 + 6)
#define                                 CLKRMD_bit          _BIT_ACCESS(PMD0,6)
// PIE5<CM1IE>
extern volatile __bit                   CM1IE               __at(0x4DE);	// @ (0x9B * 8 + 6)
#define                                 CM1IE_bit           _BIT_ACCESS(PIE5,6)
// PIR5<CM1IF>
extern volatile __bit                   CM1IF               __at(0x48E);	// @ (0x91 * 8 + 6)
#define                                 CM1IF_bit           _BIT_ACCESS(PIR5,6)
// PMD3<CM1MD>
extern volatile __bit                   CM1MD               __at(0x87E);	// @ (0x10F * 8 + 6)
#define                                 CM1MD_bit           _BIT_ACCESS(PMD3,6)
// PIE5<CM2IE>
extern volatile __bit                   CM2IE               __at(0x4DF);	// @ (0x9B * 8 + 7)
#define                                 CM2IE_bit           _BIT_ACCESS(PIE5,7)
// PIR5<CM2IF>
extern volatile __bit                   CM2IF               __at(0x48F);	// @ (0x91 * 8 + 7)
#define                                 CM2IF_bit           _BIT_ACCESS(PIR5,7)
// PMD3<CM2MD>
extern volatile __bit                   CM2MD               __at(0x87F);	// @ (0x10F * 8 + 7)
#define                                 CM2MD_bit           _BIT_ACCESS(PMD3,7)
// ADCNT<CNT0>
extern volatile __bit                   CNT0                __at(0xE8C8);	// @ (0x1D19 * 8 + 0)
#define                                 CNT0_bit            _BIT_ACCESS(ADCNT,0)
// ADCNT<CNT1>
extern volatile __bit                   CNT1                __at(0xE8C9);	// @ (0x1D19 * 8 + 1)
#define                                 CNT1_bit            _BIT_ACCESS(ADCNT,1)
// ADCNT<CNT2>
extern volatile __bit                   CNT2                __at(0xE8CA);	// @ (0x1D19 * 8 + 2)
#define                                 CNT2_bit            _BIT_ACCESS(ADCNT,2)
// ADCNT<CNT3>
extern volatile __bit                   CNT3                __at(0xE8CB);	// @ (0x1D19 * 8 + 3)
#define                                 CNT3_bit            _BIT_ACCESS(ADCNT,3)
// ADCNT<CNT4>
extern volatile __bit                   CNT4                __at(0xE8CC);	// @ (0x1D19 * 8 + 4)
#define                                 CNT4_bit            _BIT_ACCESS(ADCNT,4)
// ADCNT<CNT5>
extern volatile __bit                   CNT5                __at(0xE8CD);	// @ (0x1D19 * 8 + 5)
#define                                 CNT5_bit            _BIT_ACCESS(ADCNT,5)
// ADCNT<CNT6>
extern volatile __bit                   CNT6                __at(0xE8CE);	// @ (0x1D19 * 8 + 6)
#define                                 CNT6_bit            _BIT_ACCESS(ADCNT,6)
// ADCNT<CNT7>
extern volatile __bit                   CNT7                __at(0xE8CF);	// @ (0x1D19 * 8 + 7)
#define                                 CNT7_bit            _BIT_ACCESS(ADCNT,7)
// ADCON0<CONT>
extern volatile __bit                   CONT                __at(0xE936);	// @ (0x1D26 * 8 + 6)
#define                                 CONT_bit            _BIT_ACCESS(ADCON0,6)
// OSCCON2<COSC0>
extern volatile __bit                   COSC0               __at(0x1474);	// @ (0x28E * 8 + 4)
#define                                 COSC0_bit           _BIT_ACCESS(OSCCON2,4)
// OSCCON2<COSC1>
extern volatile __bit                   COSC1               __at(0x1475);	// @ (0x28E * 8 + 5)
#define                                 COSC1_bit           _BIT_ACCESS(OSCCON2,5)
// OSCCON2<COSC2>
extern volatile __bit                   COSC2               __at(0x1476);	// @ (0x28E * 8 + 6)
#define                                 COSC2_bit           _BIT_ACCESS(OSCCON2,6)
// CPCON<CPOS>
extern volatile __bit                   CPOS                __at(0x106D);	// @ (0x20D * 8 + 5)
#define                                 CPOS_bit            _BIT_ACCESS(CPCON,5)
// CPCON<CPRDY>
